#!/kunden/homepages/20/d100701421/htdocs/hexibex/engine/rexx

f="/kunden/homepages/20/d100701421/htdocs/hexibex/plugins/filedata/crontest"
l="ran crontest at" date(u) time()

call lineout f,l

